import { ScreenBoardLayoutsCollection } from "../Interfaces";

export const SB_T9_LAYOUTS: ScreenBoardLayoutsCollection = {
    numbers: [
        { values: [ '1' ] },
        { values: [ '2' ] },
        { values: [ '3' ] },
        { values: [ '4' ] },
        { values: [ '5' ] },
        { values: [ '6' ] },
        { values: [ '7' ] },
        { values: [ '8' ] },
        { values: [ '9' ] },
        { values: [ '0' ] }
    ],
    en: [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'b', 'c', '2' ] },
        { values: [ 'd', 'e', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        { values: [ 'm', 'n', 'o', '6' ] },
        { values: [ 'p', 'q', 'r', 's', '7' ] },
        { values: [ 't', 'u', 'v', '8' ] },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    'de-DE': [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'ä', 'b', 'c', '2' ] },
        { values: [ 'd', 'e', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        { values: [ 'm', 'n', 'o', 'ö', '6' ] },
        { values: [ 'p', 'q', 'r', 's', '7' ] },
        { values: [ 't', 'u', 'ü', 'v', '8' ] },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    'cs-CZ': [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'b', 'c', 'č', '2' ] },
        {
            values: [
                'd', 'đ', 'e',
                'é', 'ě', 'f',
                '3'
            ]
        },
        { values: [ 'g', 'h', 'i', 'í', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        { values: [ 'm', 'n', 'ň', 'o', 'ó', '6' ] },
        { values: [ 'p', 'q', 'r', 's', 'š', '7' ] },
        {
            values: [
                't', 'ť', 'u',
                'ú', 'ů', 'v',
                '8'
            ]
        },
        {
            values: [
                'w', 'x', 'y',
                'ý', 'z', 'ž',
                '9'
            ]
        },
    ],
    'fr-FR': [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'b', 'c', '2' ] },
        { values: [ 'd', 'e', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        { values: [ 'm', 'n', 'o', '6' ] },
        { values: [ 'p', 'q', 'r', 's', '7' ] },
        { values: [ 't', 'u', 'v', '8' ] },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    'es-ES': [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'b', 'c', '2' ] },
        { values: [ 'd', 'e', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        { values: [ 'm', 'n', 'ñ', 'o', '6' ] },
        { values: [ 'p', 'q', 'r', 's', '7' ] },
        { values: [ 't', 'u', 'v', '8' ] },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    'pt-BR': [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        {
            values: [
                'a', 'ã', 'â',
                'á', 'à', 'b',
                'c', 'ç', '2'
            ]
        },
        { values: [ 'd', 'e', 'é', 'ê', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', 'í', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        {
            values: [
                'm', 'n', 'o',
                'ó', 'õ', 'ô',
                '6'
            ]
        },
        { values: [ 'p', 'q', 'r', 's', '7' ] },
        { values: [ 't', 'u', 'ú', 'v', '8' ] },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    hu: [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'a', 'á', 'b', 'c', '2' ] },
        { values: [ 'd', 'e', 'é', 'f', '3' ] },
        { values: [ 'g', 'h', 'i', 'í', '4' ] },
        { values: [ 'j', 'k', 'l', '5' ] },
        {
            values: [
                'm', 'n', 'o',
                'ó', 'ö', 'ő',
                '6'
            ]
        },
        { values: [ 'p', 'q', 'r', 's', 'ß', '7' ] },
        {
            values: [
                't', 'u', 'v',
                'ú', 'ü', 'ű',
                '8'
            ]
        },
        { values: [ 'w', 'x', 'y', 'z', '9' ] },
    ],
    ru: [
        { values: ['.', ',', '-', '/', "?", "!", ":", ";", '1']},
        { values: [ 'а', 'б', 'в', 'г', '2' ] },
        { values: [ 'д', 'е', 'ё', 'ж', 'з', '3' ] },
        { values: [ 'и', 'й', 'к', 'л', '4' ] },
        { values: [ 'м', 'н', 'о', 'п', '5' ] },
        { values: [ 'р', 'с', 'т', 'у', '6' ] },
        { values: [ 'ф', 'х', 'ц', 'ч', '7' ] },
        { values: [ 'ш', 'щ', 'ъ', 'ы', '8' ] },
        { values: [ 'ь', 'э', 'ю', 'я', '9' ] },
    ]
}
